# Задача Магазин

## Описание
Это финальная задача! В этом задании попрактикуемся с правилами чистого кода и принципами ###SOLID.
### Описание  где, как и какой шаблон использован
Создаем общий абстрактный класс с описание товара
далее создаем интерфейсы Mobile с 1 пустым методом carry, и Device  в классе Phone имплементируем интерфейсы Mobile/Device
 используем:
 
 * **I - принцип сегрегации (разделения) интерфейса (Interface Segregation Principle**- применяем разные интерфейсы вместо одного Mobile/Device) 
 * **Dependency Inversion Principle** - разделив интерфейсы нет зависимости от их общей функциональности,тепер можем менять интерфейсы один на другой
 
 далее создаем интерфейс Food 1 методом sale; далее создаем класс Apple, наследуемся от абстрактного класса и имплементируем интерфейс Food. 
 Данный класс Apple описывает только данный фрукт, к другим не имеет отношения, **S - принцип единственной ответственности**.
 Далее создаем класс Baguetter/Bread (**О - Open Closed Principle - имплементируя интерфейс Food, добавляем
классу функциональности, не изменяя его код**)

далее переходим в мain -> используем правило **Magic: не используй числа напрямую в коде**, вместо чисел используем константы
        
        public static final char RUB = (char) 0x20BD;
    
далее используем **L - принцип замены Барбары Лисков (Liskov substitution principle)** - наследники класса Product полностью играют роль предка

          Product[] products = {new Bread(), new Baguetter(), new Apple(), new Phone()};
          
так же используем принцип **DRY - повторяющийся вывод** списка продуктов на экран выносим в отдельный методм printProucts(products);
        
        private static void printProucts(Product[] products) {
        System.out.println("Список возможных товаров для покупки: ");
        for (int i = 0; i < products.length; i++) {
            System.out.println((i + 1) + ". " + products[i]);
        }
    }

### Условия задачи
Нужно написать программу-магазин, в которой пользователи заказывают товары. Вам предоставляется свобода в продумывании функциональности вашей программы, как и в проектировании её структуры. В процессе реализации вы должны применить принцип избегания магических чисел, DRY и как минимум 4 из 5 принципов SOLID, причём явно комментариями в коде или при отправке решения указать по одному примеру применения каждого принципа в вашем решении со ссылками на конкретные места кода на гитхабе.

Примеры возможностей программы:
* Вывод доступных для покупки товаров
* Фильтрация товаров по ключевым словам, ценам, производителям
* Составление продуктовой корзины пользователя
* Трекинг заказа в системе доставки
* Возврат заказа, повтороение заказа
* Система рейтинга для товаров
* Простая рекомендательная система для покупок

## Реализация
1. Продумайте и зафиксируйте список возможностей вашей программы.
2. Продумайте консольный интерфейс взаимодействия пользователя с вашей программой.
3. Продумайте систему классов, которые вам понадобятся для реализации вашей программы.
4. Напишите вашу программу, явно применив вышеперечисленные принципы хорошего кода.
5. При отправке решения укажите, в чём именно было применение каждого этого принципа (по одному примеру) со ссылками на конкретные места кода на гитхабе.
6. Протестируйте работу программы. Не забывайте про правила форматирования кода (для автоформата можете выделить код в идее и нажать **Ctrl+Alt+L**).
